<a href="https://colab.research.google.com/github/dkchebet7/SQL-/blob/master/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
%load_ext sql
%sql sqlite://

'Connected: @None'

# **creating tables**

In [0]:
#challange1
%%sql
CREATE TABLE if not exists pc (
    code,
    mode1,
    speed,
    RAM,
    HD,
    CD,
    price
) ;
SELECT * from pc ;

 * sqlite://
Done.
Done.

[]

In [0]:
##challange2
%%sql
CREATE TABLE if not exists printer (
    code,
    model,
    speed,
    type,
    price
) ;
SELECT * from printer ;

 * sqlite://
Done.
Done.

[]

In [0]:
###challange3
%%sql
CREATE TABLE if not exists movies (
    id,
    title,
    director,
    year,
    length
    
) ;
select * from movies ;

 * sqlite://
Done.
Done.

[]

# **specifying column data types**

In [0]:
#challange1

%%sql
CREATE TABLE if not exists customer(
    CustID int,
    LastName varchar(25),
    FirstName varchar(20)
) ;
SELECT * from customer;

 * sqlite://
Done.
Done.

[]

In [0]:
##challange2
%%sql
CREATE TABLE if not exists sales(
    sales_ID int,
    customer_ID int,
    name text,
    adress int
) ;
SELECT * from sales;

 * sqlite://
Done.
Done.

[]

In [0]:
###challange3
%%sql
CREATE TABLE if not exists employees (
    employee_name text,
    department text,
    salary int
);
SELECT * from employees;

 * sqlite://
Done.
Done.

[]

# **Specifying column default values**

In [0]:
%%sql
CREATE TABLE if not exists players (
    player_id INT,
    player_name TEXT,
    player_salary VARCHAR(60),
    age INTEGER DEFAULT 'unkmown',
    salary INT
);
SELECT * from players;

 * sqlite://
Done.
Done.

[]

In [0]:
#CHALLANGE2
%%sql
CREATE TABLE if not exists restaurants(
    name TEXT,
    description TEXT,
    adress VARCHAR DEFAULT 'unknown',
    user_id INTEGER ,
    last_orders_at DATE
);
SELECT * from restaurants;

 * sqlite://
Done.
Done.

[]

## **Altering SQL Tables**

In [0]:
%%sql
CREATE TABLE IF NOT EXISTS TeamMembers (
    id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER DEFAULT 'Unknown',
    height REAL
);
SELECT *from TeamMembers ;


ALTER TABLE TeamMembers ADD DOB date;
SELECT *from TeamMembers;

 * sqlite://
Done.
Done.
Done.
Done.

[]

In [0]:
%%sql
PRAGMA table_info(TeamMembers);

 * sqlite://
Done.

[(0, 'id', 'INTEGER', 0, None, 1),
 (1, 'name', 'TEXT', 0, None, 0),
 (2, 'age', 'INTEGER', 0, "'Unknown'", 0),
 (3, 'height', 'REAL', 0, None, 0),
 (4, 'DOB', 'date', 0, None, 0)]

In [0]:
%%sql 
CREATE TABLE if not exists Artists (
    artist_id INT, 
    artist_name VARCHAR(60), 
    place_of_birth VARCHAR(60)
);
SELECT * from Artists;


ALTER TABLE Artists RENAME to MSA;

SELECT * from MSA;

 * sqlite://
Done.
Done.
Done.
Done.

[]

# **Dropping SQL Tables**

In [0]:
####dropping and trancating tables requires data